from random import choice
import string


HANGMAN = (
    """
     +----------+
     |          |
     |          |
     |          
     |
     |
     |
     |
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |          
     |
     |
     |
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |          *
     |          
     |
     |
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |          *
     |          |
     |          |
     |
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |          *
     |         /|
     |          
     |
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |         /|\\
     |           
     |
     |
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |          *
     |         /|\\
     |          |
     |         
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |          *
     |         /|\\
     |          |
     |         / 
     |
     |
     |
     |
     |
    ----------------
    """,
    """
     +----------+
     |          |
     |          |
     |          @
     |          *
     |         /|\\
     |          |
     |         / \\
     |
     |
     |
     |
     |
    ----------------"""
 )



WORDS = ("функция", "список", "модуль", "вычисление", "программирование", "условие", "переменная", "объект",
         "рекурсия", "алгоритм", "константа", "строка", "оператор", "кортеж", "словарь"
         )

print("""Приветствую!
Суть игры очень проста: 
Компьютер загадал русское существительное слово. Вам предстоит угадать его.
При этом вы видите на экране вместо каждой буквы слова знаки * и изображение пустой виселицы. С каждой правильно
угаданной буквой вместо знака * будет появляться угаданная буква на своем месте в слове, а с каждой ошибкой будет
появляться части тела человечка.Вы проиграли когда человечек будет повешан).""")


max_attempt = 8                # Количество попыток равно длине картежа
secret_words = choice(WORDS)              # Рандомное слово из картежа
attempt = 0                               # Число попыток
used_letter = []                          # Использование буквы
solution = "*" * len(secret_words)        # Интерфейс секрт.слова для игрока
# english_letters = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q",
#                    "r", "s", "t", "u", "v", "w", "x", "y", "z"]


while solution != secret_words and attempt < max_attempt:
    print(HANGMAN[attempt])
    print("\nСекретное слово выглядит так:\n", "\n", solution)
    if not used_letter:
        print("\nНачнем игру!")
    else:
        print("\nВы использовали эти буквы:", ",".join(used_letter))
    guess = input("\nВведите букву:").lower()


    if not guess.isalpha():
        print("-" * 40, "\n" "\nВы ввели число или символ!")
    elif len(guess) > 1:
        print("-" * 40, "\n" "Вы ввели больше одной буквы!")
    elif guess.lower() in string.ascii_letters:
        print("-" * 40, "\n" "Вы ввели английскую букву!")
    else:
        while guess in used_letter:
            print("\nВы уже использовали букву:", guess)
            guess = input("\nВведите букву:").lower()
        used_letter.append(guess)


        if guess in secret_words:
            print("-" * 40, "\n" "\nБуква" + " \'" + guess + "\' " + "есть в загаданном слове.")

            letter = ""
            for i in range(len(secret_words)):
                if guess == secret_words[i]:
                    letter += guess
                else:
                    letter += solution[i]
            solution = letter
        else:
            print("-" * 40, "\n" "\nБуквы" + " \'" + guess + "\' " + " нет в загаданном слове.")
            attempt += 1


if attempt == max_attempt:
    print("\nВы проиграли, человечка повесили(.")
    print(HANGMAN[attempt])
else:
    print("\nПоздравляю!")
    print("\nВы удали слово!")


print("\nЗагаданное слово:", "--", secret_words, "--")
